module BioMethEQK

    export EQConst1, EQConst2, EQConst3

    """
    Reaction 1: CO2 + 3H2 <-> CH3OH + H2O
    """
    function EQConst1(T)
        T₀ = 298.15 
        R  = 8.314 

        Aₘ = 2.211; Bₘ = 12.216e-3; Cₘ = -3.45e-6; Dₘ = 0.0
        Aₒ₂ = 5.457; Bₒ₂ = 1.045e-3; Cₒ₂ = 0.0; Dₒ₂ = -1.157e5
        Aₒ₁ = 3.376; Bₒ₁ = 0.557e-3; Cₒ₁ = 0.0; Dₒ₁ = -0.031e5
        Aₕ₂ = 3.249; Bₕ₂ = 0.422e-3; Cₕ₂ = 0.0; Dₕ₂ = 0.083e5
        Aₕ₂ₒ = 3.470; Bₕ₂ₒ = 1.450e-3; Cₕ₂ₒ = 0.0; Dₕ₂ₒ = 0.121e5

        ΔA₁  = (Aₘ.+Aₕ₂ₒ).-(Aₒ₂.+3Aₕ₂); ΔA₂  =  Aₘ.-(Aₒ₁.+2Aₕ₂); ΔA₃  = (Aₒ₁.+Aₕ₂ₒ).-(Aₒ₂.+Aₕ₂)
        ΔB₁  = (Bₘ.+Bₕ₂ₒ).-(Bₒ₂.+3Bₕ₂); ΔB₂  =  Bₘ.-(Bₒ₁.+2Bₕ₂); ΔB₃  = (Bₒ₁.+Bₕ₂ₒ).-(Bₒ₂.+Bₕ₂)
        ΔC₁  = (Cₘ.+Cₕ₂ₒ).-(Cₒ₂.+3Cₕ₂); ΔC₂  =  Cₘ.-(Cₒ₁.+2Cₕ₂); ΔC₃  = (Cₒ₁.+Cₕ₂ₒ).-(Cₒ₂.+Cₕ₂)
        ΔD₁  = (Dₘ.+Dₕ₂ₒ).-(Dₒ₂.+3Dₕ₂); ΔD₂  =  Dₘ.-(Dₒ₁.+2Dₕ₂); ΔD₃  = (Dₒ₁.+Dₕ₂ₒ).-(Dₒ₂.+Dₕ₂)

        ΔGₘ   = -161.960; ΔGₒ₂  = -394359.0; ΔGₒ₁  = -137169.0; ΔGₕ₂  = 0.0; ΔGₕ₂ₒ = -237129.0
        ΔG₁  = (ΔGₘ.+ΔGₕ₂ₒ).-(ΔGₒ₂.+3ΔGₕ₂); ΔG₂  =  ΔGₘ.-(ΔGₒ₁.+2ΔGₕ₂); ΔG₃  = (ΔGₒ₁.+ΔGₕ₂ₒ).-(ΔGₒ₂.+ΔGₕ₂)

        ΔHₘ   = -200660.0; ΔHₒ₂  = -393509.0; ΔHₒ₁  = -110525.0; ΔHₕ₂  = 0.0; ΔHₕ₂ₒ = -241818.0
        ΔH₁  = (ΔHₘ.+ΔHₕ₂ₒ).-(ΔHₒ₂.+3ΔHₕ₂); ΔH₂  =  ΔHₘ.-(ΔHₒ₁.+2ΔHₕ₂); ΔH₃  = (ΔHₒ₁.+ΔHₕ₂ₒ).-(ΔHₒ₂.+ΔHₕ₂)

        K₀₁ = exp.(-1.0 .*(ΔG₁)./(R.*T₀))
        K₁₁ = exp.((ΔH₁./(R.*T₀)).*(1.0 .-T₀./T))
        K₂₁ = exp.(ΔA₁.*((log.(T./T₀).-((T.-T₀)./T))).+0.5ΔB₁.*(((T.-T₀).^2)./T).+(ΔC₁./6).*(((T.-T₀).^2).*((T.+2T₀))./T).+0.5ΔD₁.*((T.-T₀).^2)./((T.^2.).*(T₀.^2.)))
        
        K₁ = K₀₁.*K₁₁.*K₂₁
        return K₁
    end

    """
    Reaction 2: CO + 2H2 <-> CH3OH
    """
    function EQConst2(T)
        T₀ = 298.15 
        R  = 8.314 

        Aₘ = 2.211; Bₘ = 12.216e-3; Cₘ = -3.45e-6; Dₘ = 0.0
        Aₒ₂ = 5.457; Bₒ₂ = 1.045e-3; Cₒ₂ = 0.0; Dₒ₂ = -1.157e5
        Aₒ₁ = 3.376; Bₒ₁ = 0.557e-3; Cₒ₁ = 0.0; Dₒ₁ = -0.031e5
        Aₕ₂ = 3.249; Bₕ₂ = 0.422e-3; Cₕ₂ = 0.0; Dₕ₂ = 0.083e5
        Aₕ₂ₒ = 3.470; Bₕ₂ₒ = 1.450e-3; Cₕ₂ₒ = 0.0; Dₕ₂ₒ = 0.121e5

        ΔA₂  =  Aₘ.-(Aₒ₁.+2Aₕ₂); ΔB₂  =  Bₘ.-(Bₒ₁.+2Bₕ₂); ΔC₂  =  Cₘ.-(Cₒ₁.+2Cₕ₂); ΔD₂  =  Dₘ.-(Dₒ₁.+2Dₕ₂)
        ΔGₘ   = -161.960; ΔGₒ₂  = -394359.0; ΔGₒ₁  = -137169.0; ΔGₕ₂  = 0.0; ΔGₕ₂ₒ = -237129.0
        ΔG₂  =  ΔGₘ.-(ΔGₒ₁.+2ΔGₕ₂)
        ΔHₘ   = -200660.0; ΔHₒ₂  = -393509.0; ΔHₒ₁  = -110525.0; ΔHₕ₂  = 0.0; ΔHₕ₂ₒ = -241818.0
        ΔH₂  =  ΔHₘ.-(ΔHₒ₁.+2ΔHₕ₂)

        K₀₂ = exp.(-1.0 .*ΔG₂./(R.*T₀))
        K₁₂ = exp.((ΔH₂./(R.*T₀)).*(1 .-T₀./T))
        K₂₂ = exp.(ΔA₂.*((log.(T./T₀).-((T.-T₀)./T))).+0.5ΔB₂.*(((T.-T₀).^2)./T).+(ΔC₂./6).*(((T.-T₀).^2).*((T.+2T₀))./T).+0.5ΔD₂.*((T.-T₀).^2)./((T.^2.).*(T₀.^2.)))
        
        K₂ = K₀₂.*K₁₂.*K₂₂
        return K₂
    end

    """
    Reaction 3 (RWGS): CO2 + H2 <-> CO + H2O
    """
    function EQConst3(T)
        T₀ = 298.15 
        R  = 8.314 

        Aₘ = 2.211; Bₘ = 12.216e-3; Cₘ = -3.45e-6; Dₘ = 0.0
        Aₒ₂ = 5.457; Bₒ₂ = 1.045e-3; Cₒ₂ = 0.0; Dₒ₂ = -1.157e5
        Aₒ₁ = 3.376; Bₒ₁ = 0.557e-3; Cₒ₁ = 0.0; Dₒ₁ = -0.031e5
        Aₕ₂ = 3.249; Bₕ₂ = 0.422e-3; Cₕ₂ = 0.0; Dₕ₂ = 0.083e5
        Aₕ₂ₒ = 3.470; Bₕ₂ₒ = 1.450e-3; Cₕ₂ₒ = 0.0; Dₕ₂ₒ = 0.121e5

        ΔA₃  = (Aₒ₁.+Aₕ₂ₒ).-(Aₒ₂.+Aₕ₂); ΔB₃  = (Bₒ₁.+Bₕ₂ₒ).-(Bₒ₂.+Bₕ₂); ΔC₃  = (Cₒ₁.+Cₕ₂ₒ).-(Cₒ₂.+Cₕ₂); ΔD₃  = (Dₒ₁.+Dₕ₂ₒ).-(Dₒ₂.+Dₕ₂)
        ΔGₘ   = -161.960; ΔGₒ₂  = -394359.0; ΔGₒ₁  = -137169.0; ΔGₕ₂  = 0.0; ΔGₕ₂ₒ = -237129.0
        ΔG₃  = (ΔGₒ₁.+ΔGₕ₂ₒ).-(ΔGₒ₂.+ΔGₕ₂)
        ΔHₘ   = -200660.0; ΔHₒ₂  = -393509.0; ΔHₒ₁  = -110525.0; ΔHₕ₂  = 0.0; ΔHₕ₂ₒ = -241818.0
        ΔH₃  = (ΔHₒ₁.+ΔHₕ₂ₒ).-(ΔHₒ₂.+ΔHₕ₂)

        K₀₃ = exp.(-1.0 .*ΔG₃./(R.*T₀))
        K₁₃ = exp.((ΔH₃./(R.*T₀)).*(1.0 .-T₀./T))
        K₂₃ = exp.(ΔA₃.*((log.(T./T₀).-((T.-T₀)./T))).+0.5ΔB₃.*(((T.-T₀).^2)./T).+(ΔC₃./6).*(((T.-T₀).^2).*((T.+2T₀))./T).+0.5ΔD₃.*((T.-T₀).^2)./((T.^2.).*(T₀.^2.)))
        
        K₃ = K₀₃.*K₁₃.*K₂₃    
        return K₃
    end

end